#### Terraform Format and Style 🖌`success`
#### dap/dap-prod - Terraform Initialization ⚙️`success`
#### dap/dap-prod - Terraform Validation 🤖Success! The configuration is valid.


#### dap/dap-prod - Terraform Plan 📖`success`

<details><summary>dap/dap-prod - Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dap.google_storage_bucket.storage_bucket will be created
  + resource "google_storage_bucket" "storage_bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "broad-dsp-monster-dap-prod-storage"
      + project                     = "broad-dsp-monster-dap-prod"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # module.dap.module.enable_services.google_project_service.cloud_resource_manager will be created
  + resource "google_project_service" "cloud_resource_manager" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.service_usage will be created
  + resource "google_project_service" "service_usage" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "serviceusage.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[0] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "compute.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[1] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "container.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[2] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "containerregistry.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[3] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "dns.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[4] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "iam.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[5] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "iamcredentials.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[6] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "logging.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[7] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "monitoring.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[8] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "replicapool.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[9] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "replicapoolupdater.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[10] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "resourceviews.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[11] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "runtimeconfig.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[12] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "sqladmin.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[13] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "sql-component.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[14] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "stackdriver.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[15] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "storage-api.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[16] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "storage-component.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[17] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "dataflow.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[18] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "storagetransfer.googleapis.com"
    }

  # module.dap.module.enable_services.google_project_service.services[19] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "pubsub.googleapis.com"
    }

Plan: 23 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @aherbst-broad, Action: `pull_request`, Working Directory: `/home/runner/work/monster-deploy/monster-deploy/environments/dap/dap-prod/terraform`, Workflow: `Terraform Plan`*